module Faker
  class Company
    class << self
      def name
        Formats.rand.call
      end
    
      def suffix
        %w(ЗАО ООО ОАО).rand
      end
      
      # Generate a buzzword-laden catch phrase.
      # Wordlist from http://www.1728.com/buzzword.htm
      def catch_phrase
        [
          ["Фирма1", "Суперфирма", "Фирма3", "ПанСамСклепав"].rand,
          ["24 часа", "24/7", "круглосуточно", "3 года на рынке"].rand,
          ["доступно", "быстро", "надежно"].rand
        ].join(' ')
      end
      
      # When a straight answer won't do, BS to the rescue!
      # Wordlist from http://dack.com/web/bullshit.html
      def bs
        [
          ["реализации", "использовать", "интеграция", "рационализации", "оптимизация", "развиваться", "преобразовать", "объятия", "включить", "организовать", "рычаг", "изобретать", "агрегат "," архитектор "," повысить "," стимулирования "," морфинг "," расширение прав и возможностей "," envisioneer "," монетизировать "," запрягать "," содействовать "," захват "," disintermediate", "развернуть", "бренд", "расти", "цель", "синдикат", "синтез", "доставить", "сетка", "высиживать", "заниматься", "максимально", " увидеть "," перепрофилирование "," инновации "," масштаб "," развязать "," драйв "," расширить "," инженер "," революцию ", "генерировать", "эксплуатировать", "переход", "д включить", "перебора", "возделывать", "матрица", "пересмотреть"].rand,
          ["кликов и минометных", "добавленную стоимость", "вертикальная", "активный", "надежный", "революционный", "масштабируемый", "передовые", "инновационный", "интуитивной"].rand,
          ["взаимодействие", "веб-готовность", "парадигм", "рынки", "партнерские", "инфраструктура", "платформ", "инициатив", "каналы", "глаза", "общины", "рентабельность", "решения", "интернет-магазинах», «электронных услуг», «действие пунктов", "порталы", "ниши", "технологии", "содержание"].rand
        ].join(' ')
      end
    end
    
    Formats = [
      Proc.new { [ Name.last_name, suffix ].join(' ') },
      Proc.new { [ Name.last_name, Name.last_name ].join('-') },
      Proc.new { "%s, %s and %s" % [ Name.last_name, Name.last_name, Name.last_name ] }
      ]
  end
end